app/views/private_messages/index.html.erb

SELECT "contacts".* FROM "contacts" WHERE "contacts"."user_id" = 2
---
    <label>Προς:</label>
    <%= select_tag :receiver_id,
    options_for_select(
      current_user.contacts.map { |c| [c.contact_user.email, c.contact_user.id] }
    ),
    required: true %>

SELECT "users".* FROM "users" WHERE "users"."id" = 2 ORDER BY "users"."id" ASC LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
---
    <strong>
      <%= message.sender_id == current_user.id ? "Εσύ" : User.find(message.sender_id).email %>
      →
      <%= message.receiver_id == current_user.id ? "Εσύ" : User.find(message.receiver_id).email %>