app/controllers/api/v1/base_controller.rb

  def authenticate_user_from_token!
    auth_header = request.headers['Authorization']
    return render json: { error: "Unauthorized" }, status: :unauthorized unless auth_header

    token = auth_header.split.last
    user = User.find_by(api_token: token)
---
SELECT "users".* FROM "users" WHERE "users"."api_token" = 'f0e8348405444b75b12083f6a2b549cf847208a5' LIMIT 1