app/controllers/api/v1/registrations_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "authentication_token", "api_token") VALUES ('a@a.gr', '$2a$12$yUcYjdGpY6YQV3v8tAx5UO2G38ys2aYvEfWZCxbX9uGxXxy4jj.Ji', NULL, NULL, NULL, '2026-01-28 10:37:07.621071', '2026-01-28 10:37:07.621071', NULL, 'f0e8348405444b75b12083f6a2b549cf847208a5') RETURNING "id"
---
  def create
    user = User.new(user_params)
    user.api_token = SecureRandom.hex(20)

    if user.save