app/controllers/api/v1/todos_controller.rb

SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = 5
---
  def index
    todos = @current_user.todos.includes(:todo_items)

INSERT INTO "todos" ("title", "user_id", "created_at", "updated_at") VALUES ('My first todo', 5, '2026-01-30 14:50:02.319635', '2026-01-30 14:50:02.319635') RETURNING "id"
---
  def create
    todo = @current_user.todos.build(todo_params)

    if todo.save