app/controllers/contacts_controller.rb

  def create
    contact = current_user.contacts.build(contact_user_id: params[:contact_user_id])
    contact.save
---
INSERT INTO "contacts" ("user_id", "contact_user_id", "created_at", "updated_at") VALUES (2, 1, '2026-01-25 17:27:56.728199', '2026-01-25 17:27:56.728199') RETURNING "id"

  def destroy
    contact = current_user.contacts.find_by(contact_user_id: params[:id])
    contact.destroy if contact
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."user_id" = 2 AND "contacts"."contact_user_id" = 1 LIMIT 1
DELETE FROM "contacts" WHERE "contacts"."id" = 1