app/controllers/posts_controller.rb

SELECT "categories".* FROM "categories"
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = 2
SELECT "posts".* FROM "posts"
---
  def index
    @categories = Category.all
    @posts = params[:category_id].present? ?
               Post.where(category_id: params[:category_id]) :
               Post.all

SELECT "categories".* FROM "categories"
---
  def new
    @post = Post.new
    @categories = Category.all

INSERT INTO "posts" ("title", "body", "user_id", "category_id", "created_at", "updated_at", "category") VALUES ('Τελική Εργασία', 'Ανακοινώθηκε η τελική εργασία εξαμήνου στο μάθημα Υπηρεσιοστρεφές Λογισμικό.', 4, 1, '2026-01-28 23:05:04.464415', '2026-01-28 23:05:04.464415', NULL) RETURNING "id"
---
  def create
    @post = current_user.posts.build(post_params)
    if @post.save