app/controllers/private_messages_controller.rb

  def index
    @messages = PrivateMessage
      .where("sender_id = ? OR receiver_id = ?", current_user.id, current_user.id)
      .order(created_at: :asc)

    @contacts = current_user.contacts.includes(:contact_user)
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."user_id" = 2
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def create
    if params[:receiver_id].to_i == current_user.id
      redirect_to private_messages_path, alert: "Δεν μπορείς να στείλεις μήνυμα στον εαυτό σου"
      return
    end

    unless current_user.contacts.exists?(contact_user_id: params[:receiver_id])
      redirect_to private_messages_path, alert: "Ο χρήστης δεν είναι στις επαφές σου"
      return
    end

    if params[:body].blank?
      redirect_to private_messages_path, alert: "Το μήνυμα δεν μπορεί να είναι κενό"
      return
    end

    PrivateMessage.create!(
      sender_id: current_user.id,
      receiver_id: params[:receiver_id],
      body: params[:body]
    )
---
SELECT 1 AS one FROM "contacts" WHERE "contacts"."user_id" = 4 AND "contacts"."contact_user_id" = 1 LIMIT 1
INSERT INTO "private_messages" ("sender_id", "receiver_id", "body", "created_at", "updated_at") VALUES (4, 1, 'Γεια σας!!', '2026-01-26 13:57:53.183186', '2026-01-26 13:57:53.183186') RETURNING "id"